controllers/DefaultController.php

SELECT * FROM `user_cards` WHERE `game_id`=3
---
    public function actionMydata()
    {
        $data['user'] = Yii::$app->user->identity;
        $data['cardinfo'] = UserCards::findOne(['game_id'=>$data['user']['game_id']]);

SELECT * FROM `auth` WHERE `game_id`=3
---
    public function actionAuthrecord(){
        $userinfo = Yii::$app->user->identity;
        $data['info'] = Auth::find()->where(['game_id'=>$userinfo->game_id])->asArray()->all();

SELECT * FROM `users` WHERE `id`='22773'
---
    public function actionDlteam(){
        $request = Yii::$app->request;
        $info = $request->get();
        //验证是否是我的下级代理
        $my_auth = User::nex_auth(Yii::$app->user->identity->game_id);
        $nex_auth_arr = [];
        foreach ($my_auth['users'] as $val){
            $nex_auth_arr[] = $val['id'];
        }
        if(!in_array($info['id'],$nex_auth_arr)){
            return $this->redirect(['/default/myagent']);
        }
        $data['user'] = User::find()->where(['id'=>$info['id']])->asArray()->one();

SELECT * FROM `users` WHERE `id`='22775'
SELECT * FROM `game_users` WHERE `game_id`='22'
---
    public function actionDlmessage(){
        $request = Yii::$app->request->get();
        $id = base64_decode($request['id']);
        $user = [];
        $user = User::find()->where(['id'=>$id])->asArray()->one();
        $gameinfo = GameUsers::findOne(['game_id'=>$user['game_id']]);