components/User.php

UPDATE `users` SET `token`='17ee9f0132dce5128a342dafb10c8a2f', `updated_at`=1513674258 WHERE `id`=22771
---
    public function doBeforeLoginThing($event)
    {
        $user = $event->identity;
        $user->generateToken();
        $user->last_login_ip = ip2long(Yii::$app->request->userIP);
        $user->updated_at = time();