models/GameUsers.php

    public static function my_game_users($game_id, $type = 0,$month = 0,$data = []){
        switch ($month){
            case 0:
                if(!$type){
                    $user = static::find()->where(['parent_id'=>$game_id])->andWhere(['role'=>3])->asArray()->all();
                }else{
                    $user = static::find()->where(['parent_id'=>$game_id])->andWhere(['role'=>3])->andWhere(['between','reg_time',strtotime('today'),strtotime('today')+86400])->asArray()->all();
---
SELECT * FROM `game_users` WHERE (`parent_id`='7') AND (`role`=3)
SELECT * FROM `game_users` WHERE ((`parent_id`=3) AND (`role`=3)) AND (`reg_time` BETWEEN 1516809600 AND 1516896000)