models/GameRecharge.php

SELECT * FROM `game_recharge` WHERE `game_id`=6
SELECT * FROM `game_recharge` WHERE (`game_id`=1) AND (`rec_time` BETWEEN 1516809600 AND 1516896000)
---
    public static function game_recharge_money(int $game_id, int $type = 0, int $month = 0,float $money = 0)
    {
        switch ($month){
            case 0:
                if($type == 0){
                    $recharges = static::find()->where(['game_id'=>$game_id])->asArray()->all();
                }elseif($type == 1){
                    $recharges = static::find()->where(['game_id'=>$game_id])->andWhere(['between','rec_time',strtotime('today'),strtotime('today')+86400])->asArray()->all();

SELECT * FROM `game_recharge` WHERE `game_id`=1
---
    public static function gameusers_profit(int $game_id,int $level,int $type=0,int $month=0,$data = array()): float
    {
        switch ($month){
            case 0:
                if($type == 0){
                    $recharge = GameRecharge::find()->where(['game_id'=>$game_id])->asArray()->all();