models/User.php

SELECT * FROM `users` WHERE `token`='d737598b5304ce3dec2dac1117e5b612'
---
    public static function findIdentityByAccessToken($accessToken, $type = null)
    {
        if (!static::isAccessTokenValid($type, $accessToken)) {
            return null;
        }
        $accessToken = base64_decode($accessToken);
        $accessToken = Yii::$app->security->decryptByKey($accessToken, static::$accessTokenEncryptKey);
        $parts = explode('_', $accessToken);
        return static::findOne(['token'=>$parts[0]]);

SELECT * FROM `users` WHERE `phone`='18684747082'
---
    public static function findByPhone($phone)
    {
        return static::findOne(['phone' => $phone]);

SELECT * FROM `users` WHERE `tuijian_id`=3
SELECT * FROM `users` WHERE (`tuijian_id`=3) AND (`created_at` BETWEEN 1516809600 AND 1516896000)
---
   public static function nex_auth($game_id,$type = 0,$month = 0,$data = []){
       switch ($month){
           case 0:
               if(!$type){
                   $nex_auths = static::find()->where(['tuijian_id'=>$game_id])->asArray()->all();
               }else{
                   $nex_auths = static::find()->where(['tuijian_id'=>$game_id])->andWhere(['between','created_at',strtotime('today'),strtotime('today')+86400])->asArray()->all();